# <font color="purple"><h3 align="center">DataFrame Basics Tutorial</h3></font>

## **Dataframe is most commonly used object in pandas. It is a table like datastructure containing rows and columns similar to excel spreadsheet**

In [2]:
import pandas as pd
# Creating a dictionary with sales data
sales_data = {
    'ProductID': [101, 102, 103, 104, 105],
    'ProductName': ['Keyboard', 'Mouse', 'Monitor', 'Headphones', 'Printer'],
    'UnitPrice': [25.99, 12.50, 189.99, 49.99, 149.99],
    'UnitsSold': [120, 200, 50, 80, 30],
    'TotalSales': [3118.80, 2500.00, 9499.50, 3999.20, 4499.70]
}

# Creating a DataFrame using the sales data
sales_df = pd.DataFrame(sales_data)
sales_df

   ProductID ProductName  UnitPrice  UnitsSold  TotalSales
0        101    Keyboard      25.99        120      3118.8
1        102       Mouse      12.50        200      2500.0
2        103     Monitor     189.99         50      9499.5
3        104  Headphones      49.99         80      3999.2
4        105     Printer     149.99         30      4499.7

In [102]:
sales_df.shape # rows, columns = df.shape

(5, 5)

In [103]:
# creates a new DataFrame (newdf) by selecting rows from index 2 (inclusive) up to index 5 (exclusive) from the original DataFrame (df). Here, it's retrieving rows with indices 2, 3, and 4.
newdf = sales_df[2:5]
newdf

   ProductID ProductName  UnitPrice  UnitsSold  TotalSales
2        103     Monitor     189.99         50      9499.5
3        104  Headphones      49.99         80      3999.2
4        105     Printer     149.99         30      4499.7

In [104]:
#df.iloc[2:5, :-1] - Using iloc, this selects a subset of rows and columns from the DataFrame df.
#2:5 - Selects rows from index 2 up to index 4 (exclusive). This will retrieve rows with indices 2, 3, and 4.
#:-1 - Selects all columns except the last one.
#:-1 implies selecting columns starting from the first column up to the last one, excluding the last column.
newdf = sales_df.iloc[2:5, :-1]
newdf

   ProductID ProductName  UnitPrice  UnitsSold
2        103     Monitor     189.99         50
3        104  Headphones      49.99         80
4        105     Printer     149.99         30

## <font color='blue'>Rows</font>

In [105]:
sales_df.head() # df.head(3)

   ProductID ProductName  UnitPrice  UnitsSold  TotalSales
0        101    Keyboard      25.99        120      3118.8
1        102       Mouse      12.50        200      2500.0
2        103     Monitor     189.99         50      9499.5
3        104  Headphones      49.99         80      3999.2
4        105     Printer     149.99         30      4499.7

In [106]:
sales_df.tail(3) # df.tail(2)

   ProductID ProductName  UnitPrice  UnitsSold  TotalSales
2        103     Monitor     189.99         50      9499.5
3        104  Headphones      49.99         80      3999.2
4        105     Printer     149.99         30      4499.7

In [107]:
#we here make condition to get the index of the first row
sales_df.index[sales_df.ProductID ==  101][0]

0

In [108]:
#df.index[df.day == "1/4/2017"]:
#df.day == "1/4/2017" - This condition checks where the 'day' column in the DataFrame df is equal to the string "1/4/2017".
#df.index[df.day == "1/4/2017"] - Retrieves the index/indices where this condition is True.
#df.index[df.day == "1/4/2017"][0]:

#[0] at the end retrieves the first element of the resulting index/indices. This assumes there's only one match. If there are multiple matches, [0] will fetch the index of the first occurrence.
#int(df.index[df.day == "1/4/2017"][0]):
#int(...) - Converts the resulting index (which is initially a Pandas index type) into an integer.

startindex = int(sales_df.index[sales_df.ProductName =="Keyboard"][0])
type(startindex)

int

In [109]:
#We here slicing ex.  we start from index 3 and end at index 5 included
sales_df[ startindex : startindex + 3 ]

   ProductID ProductName  UnitPrice  UnitsSold  TotalSales
0        101    Keyboard      25.99        120      3118.8
1        102       Mouse      12.50        200      2500.0
2        103     Monitor     189.99         50      9499.5

## <font color='blue'>Columns</font>

In [110]:
# Printing the column names of the DataFrame 'df'
# Storing the column names of the DataFrame 'df' as a list
# Printing the column names converted to a list
print(sales_df.columns)
columnNames = sales_df.columns.to_list()
print(columnNames)

Index(['ProductID', 'ProductName', 'UnitPrice', 'UnitsSold', 'TotalSales'], dtype='object')
['ProductID', 'ProductName', 'UnitPrice', 'UnitsSold', 'TotalSales']

In [111]:
#To get the data of that column 
sales_df.ProductID

0    101
1    102
2    103
3    104
4    105
Name: ProductID, dtype: int64

In [112]:
#take the data and put it into list
product_IDlist = sales_df.ProductID.to_list()
product_IDlist

[101, 102, 103, 104, 105]

In [113]:
#if you want to access two columns
twodf = sales_df[ ['ProductID','ProductName']  ]
twodf

   ProductID ProductName
0        101    Keyboard
1        102       Mouse
2        103     Monitor
3        104  Headphones
4        105     Printer

In [114]:
sales_df[["ProductID", "ProductName"]]

   ProductID ProductName
0        101    Keyboard
1        102       Mouse
2        103     Monitor
3        104  Headphones
4        105     Printer

## <font color='blue'>Operations On DataFrame</font>

In [115]:
#To get the mean and standard deviation
print(sales_df.TotalSales.mean())
print(sales_df['TotalSales'].std())

4723.4400000000005
2779.56324141042

In [116]:
#this line of code calculates the number of rows in the DataFrame df where the temperature is greater than 30.
len(sales_df[ sales_df['UnitsSold'] > 30 ])

4

In [117]:
#this line of code fetches the 'day' value(s) where the temperature is at its minimum in the DataFrame df. If there are multiple days with the same minimum temperature, it will return all corresponding 'day' values in a Series.
sales_df['ProductID'][sales_df['TotalSales'] == sales_df['TotalSales'].min() ]
# Kinda doing SQL in pandas

1    102
Name: ProductID, dtype: int64

In [118]:
sales_df.TotalSales.std()

2779.56324141042

In [119]:
#We here use sort_values to sort the values from small to big
sales_df = sales_df.ProductID.sort_values()
sales_df

0    101
1    102
2    103
3    104
4    105
Name: ProductID, dtype: int64

In [3]:
#We use value_counts to count how many the data occures
#This method is helpful in understanding the distribution of different events recorded in the 'event' column of the DataFrame.
sales_df.ProductID.value_counts()

101    1
102    1
103    1
104    1
105    1
Name: ProductID, dtype: int64

In [4]:
#Executing df.event.value_counts().index[0] would return the string 'Sunny' as it's the most frequent event in the 'event' column based on the counts obtained from value_counts().
sales_df.ProductID.value_counts().index[0]

101

In [6]:
sales_df.ProductID.value_counts()

101    1
102    1
103    1
104    1
105    1
Name: ProductID, dtype: int64

In [8]:
#We here get the basic statistics
sales_df.describe()

        ProductID   UnitPrice   UnitsSold   TotalSales
count    5.000000    5.000000    5.000000     5.000000
mean   103.000000   85.692000   96.000000  4723.440000
std      1.581139   79.385666   67.305275  2779.563241
min    101.000000   12.500000   30.000000  2500.000000
25%    102.000000   25.990000   50.000000  3118.800000
50%    103.000000   49.990000   80.000000  3999.200000
75%    104.000000  149.990000  120.000000  4499.700000
max    105.000000  189.990000  200.000000  9499.500000

**Google pandas series operations to find out list of all operations**
http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html

## <font color='blue'>set_index</font>

In [9]:
#we here use set index to set the index according to specific column
sales_df.set_index("ProductID", inplace=True)

In [10]:
sales_df

          ProductName  UnitPrice  UnitsSold  TotalSales
ProductID
101          Keyboard      25.99        120      3118.8
102             Mouse      12.50        200      2500.0
103           Monitor     189.99         50      9499.5
104        Headphones      49.99         80      3999.2
105           Printer     149.99         30      4499.7

In [11]:
#We use shape to get the number of row and column
sales_df.shape

(5, 4)

In [12]:
#we use loc by label 
sales_df.loc[101 : 104]

          ProductName  UnitPrice  UnitsSold  TotalSales
ProductID
101          Keyboard      25.99        120      3118.8
102             Mouse      12.50        200      2500.0
103           Monitor     189.99         50      9499.5
104        Headphones      49.99         80      3999.2

In [13]:
#we use reset_index to reset the index from 0 to n
sales_df.reset_index(inplace=True)
sales_df

   ProductID ProductName  UnitPrice  UnitsSold  TotalSales
0        101    Keyboard      25.99        120      3118.8
1        102       Mouse      12.50        200      2500.0
2        103     Monitor     189.99         50      9499.5
3        104  Headphones      49.99         80      3999.2
4        105     Printer     149.99         30      4499.7

In [14]:
sales_df.reset_index(inplace=True)

In [15]:
#copy to take the same dataframe
newdf = sales_df.copy()
newdf.set_index("ProductName" , inplace=True)

In [16]:
newdf

             index  ProductID  UnitPrice  UnitsSold  TotalSales
ProductName
Keyboard         0        101      25.99        120      3118.8
Mouse            1        102      12.50        200      2500.0
Monitor          2        103     189.99         50      9499.5
Headphones       3        104      49.99         80      3999.2
Printer          4        105     149.99         30      4499.7

In [17]:
sales_df

   index  ProductID ProductName  UnitPrice  UnitsSold  TotalSales
0      0        101    Keyboard      25.99        120      3118.8
1      1        102       Mouse      12.50        200      2500.0
2      2        103     Monitor     189.99         50      9499.5
3      3        104  Headphones      49.99         80      3999.2
4      4        105     Printer     149.99         30      4499.7

In [20]:
newdf.set_index("UnitsSold" , inplace=True)

In [21]:
newdf

           index  ProductID  UnitPrice  TotalSales
UnitsSold
120            0        101      25.99      3118.8
200            1        102      12.50      2500.0
50             2        103     189.99      9499.5
80             3        104      49.99      3999.2
30             4        105     149.99      4499.7

In [22]:
newdf.reset_index(inplace=True)

In [24]:
newdf.set_index("UnitsSold", inplace=True)
newdf

           index  ProductID  UnitPrice  TotalSales
UnitsSold
120            0        101      25.99      3118.8
200            1        102      12.50      2500.0
50             2        103     189.99      9499.5
80             3        104      49.99      3999.2
30             4        105     149.99      4499.7

In [27]:
newdf.loc[200]

index            1.0
ProductID      102.0
UnitPrice       12.5
TotalSales    2500.0
Name: 200, dtype: float64

In [29]:
newdf.loc[30]

index            4.00
ProductID      105.00
UnitPrice      149.99
TotalSales    4499.70
Name: 30, dtype: float64

In [33]:
sales_df.drop("index", inplace=True, axis = 1)

In [34]:
sales_df

   ProductID ProductName  UnitPrice  UnitsSold  TotalSales
0        101    Keyboard      25.99        120      3118.8
1        102       Mouse      12.50        200      2500.0
2        103     Monitor     189.99         50      9499.5
3        104  Headphones      49.99         80      3999.2
4        105     Printer     149.99         30      4499.7

In [35]:
sales_df.index

RangeIndex(start=0, stop=5, step=1)

In [36]:
#df.reset_index(inplace=True)
sales_df.set_index("ProductID", inplace=True)

In [37]:
sales_df

          ProductName  UnitPrice  UnitsSold  TotalSales
ProductID
101          Keyboard      25.99        120      3118.8
102             Mouse      12.50        200      2500.0
103           Monitor     189.99         50      9499.5
104        Headphones      49.99         80      3999.2
105           Printer     149.99         30      4499.7

In [38]:
sales_df.head()

          ProductName  UnitPrice  UnitsSold  TotalSales
ProductID
101          Keyboard      25.99        120      3118.8
102             Mouse      12.50        200      2500.0
103           Monitor     189.99         50      9499.5
104        Headphones      49.99         80      3999.2
105           Printer     149.99         30      4499.7

In [39]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Sunny', 'Sunny']
}
df = pd.DataFrame(weather_data)
df.set_index('event',inplace=True) # this is kind of building a hash map using event as a key
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Sunny  1/5/2017           32          4
Sunny  1/6/2017           31          2

In [40]:
df

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Sunny  1/5/2017           32          4
Sunny  1/6/2017           31          2

In [48]:
dataframe["Id"].dtype

dtype('O')

In [53]:
dataframe.id.astype(np.int8)

0    1
1    2
Name: id, dtype: int8

In [86]:
dataframe.Age = dataframe.Age.astype(np.int16)
dataframe.Age.dtype

dtype('int16')